protogia/avr-descriptionfiles-4-nim/svd/ATmega32HVB.atdf.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TC1</name>
      <description>Timer/Counter, 16-bit</description>
      <baseAddress>0x00000036</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4A</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x52</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GTCCR</name>
          <description>General Timer/Counter Control Register</description>
          <addressOffset>0xD</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PSRSYNC</name>
              <description>Prescaler Reset</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TSM</name>
              <description>Timer/Counter Synchronization Mode</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR1A</name>
          <description>Output Compare Register 1A</description>
          <addressOffset>0x52</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR1A</name>
              <description>Output Compare 1 A bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>OCR1B</name>
          <description>Output Compare Register B</description>
          <addressOffset>0x53</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>OCR1B</name>
              <description>Output Compare 1 B bits</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1A</name>
          <description>Timer/Counter 1 Control Register A</description>
          <addressOffset>0x4A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>WGM10</name>
              <description>Waveform Generation Mode</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICS1</name>
              <description>Input Capture Select</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICES1</name>
              <description>Input Capture Edge Select</description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICNC1</name>
              <description>Input Capture Noise Canceler</description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICEN1</name>
              <description>Input Capture Mode Enable</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TCW1</name>
              <description>Timer/Counter Width</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TCCR1B</name>
          <description>Timer/Counter1 Control Register B</description>
          <addressOffset>0x4B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CS</name>
              <description>Clock Select1 bis</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_CLOCK_SOURCE_STOPPED</name>
                  <description>No Clock Source (Stopped)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_NO_PRESCALING</name>
                  <description>Running, No Prescaling</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_8</name>
                  <description>Running, CLK/8</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_64</name>
                  <description>Running, CLK/64</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_256</name>
                  <description>Running, CLK/256</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_CLK_1024</name>
                  <description>Running, CLK/1024</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_EXTCLK_TN_FALLING_EDGE</name>
                  <description>Running, ExtClk Tn Falling Edge</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING_EXTCLK_TN_RISING_EDGE</name>
                  <description>Running, ExtClk Tn Rising Edge</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TCNT1</name>
          <description>Timer Counter 1 Bytes</description>
          <addressOffset>0x4E</addressOffset>
          <size>0x10</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TCNT1</name>
              <description>Timer Counter 1 bits</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>65535</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>TIFR1</name>
          <description>Timer/Counter Interrupt Flag register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOV1</name>
              <description>Timer/Counter1 Overflow Flag</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF1A</name>
              <description>Timer/Counter1 Output Compare Flag A</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCF1B</name>
              <description>Timer/Counter1 Output Compare Flag B</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICF1</name>
              <description>Timer/Counter 1 Input Capture Flag</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMSK1</name>
          <description>Timer/Counter Interrupt Mask Register</description>
          <addressOffset>0x39</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TOIE1</name>
              <description>Timer/Counter1 Overflow Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE1A</name>
              <description>Timer/Counter1 Output Compare A Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OCIE1B</name>
              <description>Timer/Counter1 Output Compare B Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ICIE1</name>
              <description>Timer/Counter n Input Capture Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
